#### Import pandas with its alias

In [1]:
import pandas as pd

#### Load the `TopRichestInWorld.csv` file and make 'Name' the index and 'Age' the column

In [ ]:
df = pd.read_csv("TopRichestInWorld.csv", index_col="Name", usecols=["Name", "Age"])
df.head()

                          Age
Name
Elon Musk                  50
Jeff Bezos                 58
Bernard Arnault & family   73
Bill Gates                 66
Warren Buffett             91

#### Which person is the oldest?

In [3]:
df.idxmax()

Age    Lee Shau Kee
dtype: object

#### How old is he?

In [4]:
df.max()

Age    94
dtype: int64

#### Sort the values from the oldest to youngest age to verify

In [ ]:
df.sort_values(by="Age", ascending=False).head(1)

              Age
Name
Lee Shau Kee   94

#### Which person is the youngest?

In [6]:
df.idxmin()

Age    Sam Bankman-Fried
dtype: object

#### How young is the youngest?

In [7]:
df.min()

Age    30
dtype: int64

#### What is the average age of all the millionaires? (Round it to 2 decimal places)

In [8]:
df.mean().round(2)

Age    67.12
dtype: float64

#### Save the series as a csv file named: sample.csv

In [ ]:
df.to_csv("sample.csv")

#### Read the csv you just saved

In [ ]:
sample = pd.read_csv("sample.csv")
sample.head()

                       Name  Age
0                 Elon Musk   50
1                Jeff Bezos   58
2  Bernard Arnault & family   73
3                Bill Gates   66
4            Warren Buffett   91